1. 64 = 2^i
	2^6 = 64
	1000 символов * 6 бит = 6000/8 = 750 байт 

2. 1024кб - 1мб
	1/128 = 1024кб / 128 = 8кб
	65536 бит / 1024 символа = 64 бита на символ 2^64 = 18446744073709552000

3. t = 5 минут
	128*16*5 = 1024бит = 1280 байт

4. 28(10) в троичную систему = 1001
	28 / 3 = 9 с остатком 1
	9 / 3 = 3 с остатком 0
	3 / 3 = 1 с остатком 0
	1 последнее частное меньше чем делитель.

5. RGB занимает 72кб
	24бита на пиксель берем как стандарт!
	24576 пикселей
	156х156

8. Л - 00 
	М - 01
	Н - 11
	П - 100
	Р - 101

 Л  М  П   Р    М  Н  Р
 00 01 100 101001111010

 01 11 000111100
 М  Н  
 Условие Фано.

 01 01 01 01 01 11 11 01 01 01 01 100

Р   - 001
О   - 011
З   - 111
А   - 11010 (010)
У   - 100
П   - 000
Л   - 1010
Н   - 1011
[]  - 11011 (110) 

0010111111101011011100000110101010110101101110111101011011101011010000100110111101011101100111010

